icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_sms.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		//  jt808_sms.c
 * Author:			//  baiyangmin
 * Date:			//  2013-07-08
 * Description:		//  短信处理及发送，接收，修改参数等功能
 * Version:			//  V0.01
 * Function List:	//  主要函数及其功能
 *     1. -------
 * History:			//  历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/

#include <rtthread.h>
#include <rthw.h>
#include "stm32f4xx.h"
#include <finsh.h>

#include  <stdlib.h> //数字转换成字符串
#include  <stdio.h>
#include  <string.h>
#include  "jt808_sms.h"
#include "jt808.h"
#include "jt808_param.h"
#include "jt808_gps.h"
#include "m66.h"
#include "gps.h"

#define SMS_CMD_RESET		0x01			///复位设备
#define SMS_CMD_RELINK		0x02		///重新连接模块
#define SMS_CMD_FACTSET		0x04		///恢复出厂设置
#define SMS_CMD_SAVEPARAM	0x08		///保存参数到flash中
#define SMS_CMD_FACTSETDATA	0x10		///恢复出厂数据


#define HALF_BYTE_SWAP( a ) ( ( ( ( a ) & 0x0f ) << 4 ) | ( ( a ) >> 4 ) )
#define GSM_7BIT	0x00
#define GSM_UCS2	0x08

static const char	sms_gb_data[]	= "冀京津沪宁渝琼藏川粤青贵闽吉陕蒙晋甘桂鄂赣浙苏新鲁皖湘黑辽云豫";
static uint16_t		sms_ucs2[31]	= { 0x5180, 0x4EAC, 0x6D25, 0x6CAA, 0x5B81, 0x6E1D, 0x743C, 0x85CF, 0x5DDD, 0x7CA4, 0x9752,
	                                    0x8D35,		   0x95FD, 0x5409, 0x9655, 0x8499, 0x664B, 0x7518, 0x6842, 0x9102, 0x8D63,
	                                    0x6D59,		   0x82CF, 0x65B0, 0x9C81, 0x7696, 0x6E58, 0x9ED1, 0x8FBD, 0x4E91, 0x8C6B, };

static char			sender[32];			///接收到的短信源号码，该号码为PDU格式号码
static char			smsc[32];			///接收到的短信中心号码，该号码为PDU格式号码
static char 		sms_command = 0;		///表示接收到命令后的相关操作，因为需要发送短信成功后才执行操作，所以需要等待一段时间

/**/
u16  gsmencode8bit( const char *pSrc, char *pDst, u16 nSrcLength )
{
	u16 m;
	// 简单复制
	for( m = 0; m < nSrcLength; m++ )
	{
		*pDst++ = *pSrc++;
	}

	return nSrcLength;
}

/**/
static uint16_t ucs2_to_gb2312( uint16_t uni )
{
	uint8_t i;
	for( i = 0; i < 31; i++ )
	{
		if( uni == sms_ucs2[i] )
		{
			return ( sms_gb_data[i * 2] << 8 ) | sms_gb_data[i * 2 + 1];
		}
	}
	return 0xFF20;
}

/**/
static uint16_t gb2312_to_ucs2( uint16_t gb )
{
	uint8_t i;
	for( i = 0; i < 31; i++ )
	{
		if( gb == ( ( sms_gb_data[i * 2] << 8 ) | sms_gb_data[i * 2 + 1] ) )
		{
			return sms_ucs2[i];
		}
	}
	return 0;
}

/*ucs2过来的编码*/
u16 gsmdecodeucs2( char* pSrc, char* pDst, u16 nSrcLength )
{
	u16			nDstLength = 0; // UNICODE宽字符数目
	u16			i;
	uint16_t	uni, gb;
	char		* src	= pSrc;
	char		* dst	= pDst;

	for( i = 0; i < nSrcLength; i += 2 )
	{
		uni = ( src[i] << 8 ) | src[i + 1];
		if( uni > 0x80 ) /**/
		{
			gb			= ucs2_to_gb2312( uni );
			*dst++		= ( gb >> 8 );
			*dst++		= ( gb & 0xFF );
			nDstLength	+= 2;
		}else /*也是双字节的 比如 '1' ==> 0031*/
		{
			*dst++ = uni;
			nDstLength++;
		}
	}
	return nDstLength;
}

/**/
u16 gsmencodeucs2( u8* pSrc, u8* pDst, u16 nSrcLength )
{
	uint16_t	len = nSrcLength;
	uint16_t	gb, ucs2;
	uint8_t		*src	= pSrc;
	uint8_t		*dst	= pDst;

	while( len )
	{
		gb = *src++;
		if( gb > 0x7F )
		{
			gb		|= *src++;
			ucs2	= gb2312_to_ucs2( gb ); /*有可能没有找到返回00*/
			*dst++	= ( ucs2 >> 8 );
			*dst++	= ( ucs2 & 0xFF );
			len		-= 2;
		}else
		{
			*dst++	= 0x00;
			*dst++	= ( gb & 0xFF );
			len--;
		}
	}
	// 返回目标编码串长度
	return ( nSrcLength << 1 );
}

/**/
u16 gsmdecode7bit( char* pSrc, char* pDst, u16 nSrcLength )
{
	u16 nSrc;   // 源字符串的计数值
	u16 nDst;   // 目标解码串的计数值
	u16 nByte;  // 当前正在处理的组内字节的序号，范围是0-6
	u8	nLeft;  // 上一字节残余的数据

	// 计数值初始化
	nSrc	= 0;
	nDst	= 0;

	// 组内字节序号和残余数据初始化
	nByte	= 0;
	nLeft	= 0;

	// 将源数据每7个字节分为一组，解压缩成8个字节
	// 循环该处理过程，直至源数据被处理完
	// 如果分组不到7字节，也能正确处理
	while( nSrc < nSrcLength )
	{
		*pDst	= ( ( *pSrc << nByte ) | nLeft ) & 0x7f;    // 将源字节右边部分与残余数据相加，去掉最高位，得到一个目标解码字节
		nLeft	= *pSrc >> ( 7 - nByte );                   // 将该字节剩下的左边部分，作为残余数据保存起来
		pDst++;                                             // 修改目标串的指针和计数值
		nDst++;
		nByte++;                                            // 修改字节计数值
		if( nByte == 7 )                                    // 到了一组的最后一个字节
		{
			*pDst = nLeft;                                  // 额外得到一个目标解码字节
			pDst++;                                         // 修改目标串的指针和计数值
			nDst++;
			nByte	= 0;                                    // 组内字节序号和残余数据初始化
			nLeft	= 0;
		}
		pSrc++;                                             // 修改源串的指针和计数值
		nSrc++;
	}
	*pDst = 0;
	return nDst;                                            // 返回目标串长度
}


/*信息编码为7bit pdu模式,并发送*/


/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void sms_encode_pdu_7bit( char* info ,char *sendnum )
{
#define BITMASK_7BITS 0x7F

	char			buf[200];
	uint16_t		len;
	char			*pSrc, *pDst;
	unsigned char	c;
	char			ASC[]	= "0123456789ABCDEF";
	uint8_t			count	= 0;

	unsigned char	nSrc	= 0, nDst = 0, nChar = 0;
	uint8_t			nLeft	= 0;
	char			DA_buf[32];

	memset(buf,0,sizeof(buf));
	memset(DA_buf,0,sizeof(DA_buf));
	if(((uint32_t)sendnum == 0)||(strlen(sendnum) == 0))
		{
		strcpy(DA_buf,sender);
		}
	else
		{
		strcpy(DA_buf,sendnum);
		}
	memset(buf,0,sizeof(buf));
	len = strlen( info );
	rt_kprintf( "\nSMS>ENCODE(%d):%s", len, info );

	//strcpy( buf, "0891683108200205F01100" );
	strcpy( buf, "001100" );
	count = strlen( DA_buf );
	strcat( buf, DA_buf );
	strcat( buf, "000000" );                                //	7bit编码

	pSrc	= info;
	pDst	= buf + ( count + 12 + 2 );                     //sender长度+12ASC+2预留TP长度

	while( nSrc < ( len + 1 ) )
	{
		nChar = nSrc & 0x07;                                // 取源字符串的计数值的最低3位
		if( nChar == 0 )                                    // 处理源串的每个字节
		{
			nLeft = *pSrc;                                  // 组内第一个字节，只是保存起来，待处理下一个字节时使用
		}else
		{
			c		= ( *pSrc << ( 8 - nChar ) ) | nLeft;   // 组内其它字节，将其右边部分与残余数据相加，得到一个目标编码字节
			*pDst++ = ASC[c >> 4];
			*pDst++ = ASC[c & 0x0f];
			nLeft	= *pSrc >> nChar;                       // 将该字节剩下的左边部分，作为残余数据保存起来
			nDst++;
		}
		pSrc++;
		nSrc++;                                             // 修改源串的指针和计数值
	}
	*pDst = 0;
	//buf[count + 28] = ASC[len >> 4];
	//buf[count + 29] = ASC[len & 0x0F];
	buf[count + 12] = ASC[len >> 4];
	buf[count + 13] = ASC[len & 0x0F];

