icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_sms.c
	//rt_kprintf( "\nSMS>encode 7BIT:%s", buf );
	//sms_tx( buf, ( strlen( buf ) - 18 ) >> 1 );
	sms_tx( buf, ( strlen( buf ) - 2 ) >> 1 );				//因为CMGS发送的长度不包括SCA的长度，在该发送短信中SCA为"00"，所以减2
}

/*信息编码为uscs2 pdu模式,并发送*/
void sms_encode_pdu_ucs2( char* info ,char *sendnum)
{
	char		buf[200];
	uint16_t	len, gb, ucs2;
	char		*pSrc, *pDst;
	char		ASC[]	= "0123456789ABCDEF";
	uint8_t		count	= 0;
	uint8_t		TP_UL	= 0;
	char		DA_buf[32];

	memset(buf,0,sizeof(buf));
	memset(DA_buf,0,sizeof(DA_buf));
	if(((uint32_t)sendnum == 0)||(strlen(sendnum) == 0))
		{
		strcpy(DA_buf,sender);
		}
	else
		{
		strcpy(DA_buf,sendnum);
		}

	len = strlen( info );
	rt_kprintf( "\nSMS>ENCODE(%d):%s", len, info );

//	strcpy(buf,smsc,strlen(smsc));
	strcpy( buf, "001100" );	//不设置短信中心方式发送，默认均采用该方法发送
	count = strlen( DA_buf );
	strcat( buf, DA_buf );
	strcat( buf, "00088F" );	//从左往右含义，第一个00是PID，默认均为00；08为DCS表示UCS2编码；8F为VP表示消息有效期 (8F+1)*5 分钟。
//	ucs2bit编码
	pSrc	= info;
	pDst	= buf + ( count + 12 + 2 ); //sender长度+12ASC+2预留TP长度
	while( *pSrc )
	{
		gb = *pSrc++;
		if( gb > 0x7F )
		{
			gb		<<= 8;
			gb		|= *pSrc++;
			ucs2	= gb2312_to_ucs2( gb ); /*有可能没有找到返回00*/
			*pDst++ = ASC[( ucs2 & 0xF000 ) >> 12];
			*pDst++ = ASC[( ucs2 & 0x0F00 ) >> 8];
			*pDst++ = ASC[( ucs2 & 0x00F0 ) >> 4];
			*pDst++ = ASC[( ucs2 & 0x000F )];
		}else
		{
			*pDst++ = '0';
			*pDst++ = '0';
			*pDst++ = ASC[gb >> 4];
			*pDst++ = ASC[gb & 0x0F];
		}
		TP_UL += 2;
	}
	*pDst			= 0;
	buf[count + 12] = ASC[TP_UL >> 4];
	buf[count + 13] = ASC[TP_UL & 0x0F];

	//rt_kprintf( "\nSMS>encode UCS2:%s", buf );
	sms_tx( buf, ( strlen( buf ) - 2 ) >> 1 );						//因为CMGS发送的长度不包括SCA的长度，在该发送短信中SCA为"00"，所以减2
}


/*********************************************************************************
  *函数名称:void set_phone_num(char * str)
  *功能描述:设置要发送的目的移动设备号码
  *输	入:	str	:目的手机号码
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-11-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void set_phone_num(char * str)
{
	uint8_t		i,j;
	uint8_t 	len=strlen(str);
	char *pbuf;
	
	memset(sender,0,sizeof(sender));
	//memcpy(sender,"0D9068",6);
	sprintf(sender,"%02X9168",len+2);
	//memcpy(sender,"0D9168",6);
	memcpy(sender+6,str,len);
	if(len%2)
		sender[6+len] = 'F';
	pbuf = sender + 6;
	for(i=0;i<len;i+=2)
		{
		j=pbuf[i];
		pbuf[i]=pbuf[i+1];
		pbuf[i+1]=j;
		}
	rt_kprintf("\n phont_num=%s",sender);
}
FINSH_FUNCTION_EXPORT( set_phone_num, sms set_phone_num );


/*********************************************************************************
  *函数名称:void sms_send(char * phone_num,char *str)
  *功能描述:发送短信，自动识别采用7BIT编码还是UCS2编码
  *输	入:	phone_num	:目的手机号码
  			str			:短信内容
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-11-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void sms_send(char *str,char * phone_num)
{
 uint8_t i;
 char	buf[162];
 int	len=0;
 
 if(((uint32_t)phone_num )&&(strlen(phone_num)))
	{
	set_phone_num(phone_num);
	}
 
 for(i=0;i<strlen(str);i++)
 	{
 	if(str[i] > 0x7F)
 		{
 		sms_encode_pdu_ucs2(str,0);
		return;
 		}
 	}
 while(strlen(str))
 	{
 	memset(buf,0,sizeof(buf));
	
 	if(strlen(str)>160)
		{
		len	= 160;
 		}
	else
		{
		len	= strlen(str);
		}

	memcpy(buf,str,len);
	sms_encode_pdu_7bit(str,0);
	str+=len;
 	}
}
FINSH_FUNCTION_EXPORT( sms_send, sms_send );


/*输入命令,按要求返回
   对于查询命令直接发送 返回0，不需要应答或内部已应答
   其他命令返回1,交由调用方处理,需要通用应答


 */
uint8_t analy_param( char* cmd, char*value ,uint8_t send_sms)
{
	char buf[160];
	char ip[32];
	int port;
	uint32_t id;
	
	if( strlen( cmd ) == 0 )
	{
		return 0;
	}
	rt_kprintf( "\nSMS>cmd=%s,value=%s", cmd, value );
/*先找不带参数的*/
	if( strncmp( cmd, "TIREDCLEAR", 10 ) == 0 )
	{
		jt808_param_bk.utc_over_time_start=0;
		return 1;
	}
	if( strncmp( cmd, "DISCLEAR", 8 ) == 0 )
	{
		jt808_param_bk.car_mileage=0;
		jt808_data.id_0xFA01 = 0;
		data_save();
		return 1;
	}
	if( strncmp( cmd, "RESET", 5 ) == 0 )               /*要求复位,发送完成后复位，如何做?*/
	{
		sms_command |= SMS_CMD_RESET;
		return 1;
	}else if( strncmp( cmd, "CLEARREGIST", 11 ) == 0 )  /*清除注册*/
	{
		memset( jt808_param.id_0xF003, 0, 32 );         /*清除鉴权码*/
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}


/*带参数的，先判有没有参数*/
	if( strlen( value ) == 0 )
	{
		return 0;
	}
/*查找对应的参数*/
	if( strncmp( cmd, "DNSR", 4 ) == 0 )
	{
		if( cmd[4] == '1' )
		{
			strcpy( jt808_param.id_0x0013, value );
		}
		if( cmd[4] == '2' )
		{
			strcpy( jt808_param.id_0x0017, value );
		}
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	else if( strncmp( cmd, "PORT", 4 ) == 0 )
	{
		if( cmd[4] == '1' )
		{
			jt808_param.id_0x0018=atoi( value );
			sms_command |= SMS_CMD_SAVEPARAM;
		}
		if( cmd[4] == '2' )
		{
			jt808_param.id_0xF031=atoi( value );
			sms_command |= SMS_CMD_SAVEPARAM;
		}
		if( cmd[4] == '3' )
		{
			jt808_param_bk.update_port=atoi( value );
			param_save_bksram();
		}
		return 1;
	}
	else if( strncmp( cmd, "IP", 2 ) == 0 )
	{
		jt808_param_bk.updata_utctime = 0;
		if( cmd[2] == '1' )
		{
			strcpy( jt808_param.id_0x0013, value );
			sms_command |= SMS_CMD_SAVEPARAM;
		}
		if( cmd[2] == '2' )
		{
			strcpy( jt808_param.id_0x0017, value );
			sms_command |= SMS_CMD_SAVEPARAM;
		}
		if( cmd[2] == '3' )
		{
			strcpy( jt808_param_bk.update_ip, value );
			jt808_param_bk.updata_utctime = 7200;
			//gsmstate( GSM_POWEROFF );
		}
		sms_command |= SMS_CMD_RELINK;
		param_save_bksram();
		return 1;
	}
	else if( strncmp( cmd, "DUR", 3 ) == 0 )
	{
		jt808_param.id_0x0029=atoi(value);
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	else if( strncmp( cmd, "SIMID", 6 ) == 0 )
	{
		strcpy( jt808_param.id_0xF006, value );
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	else if( strncmp( cmd, "DEVICEID", 8 ) == 0 )
	{
		strcpy( jt808_param.id_0xF002, value ); /*终端ID 大写字母+数字*/
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	else if( strncmp( cmd, "MODE", 4 ) == 0 )        ///6. 设置定位模式
	{
		if( strncmp( value, "BD", 2 ) == 0 )
		{
			gps_status.mode = MODE_BD;
		}
		if( strncmp( value, "GP", 2 ) == 0 )
		{
			gps_status.mode = MODE_GPS;
		}
		if( strncmp( value, "GN", 2 ) == 0 )
		{
			gps_status.mode= MODE_BDGPS;
		}
		gps_mode( gps_status.mode );
		return 1;
	}
	else if( strncmp( cmd, "VIN", 3 ) == 0 )
	{
		strcpy( jt808_param.id_0xF005, value ); /*VIN(TJSDA09876723424243214324)*/
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	/*	RELAY(0)关闭继电器 继电器通 RELAY(1) 断开继电器 继电器断*/
	else if( strncmp( cmd, "RELAY", 5 ) == 0 )
	{
		return 1;
	}
	else if( strncmp( cmd, "TAKE", 4 ) == 0 )    /*拍照 1.2.3.4路*/
	{	
		Cam_takepic(value[0]-'0',1,1,8);
		return 1;
	}
	else if( strncmp( cmd, "PLAY", 4 ) == 0 )    /*语音播报*/
	{
		tts_write( value, strlen( value ) );
		return 1;
	}
	else if(( strncmp( cmd, "QUERY", 5 ) == 0 )&&(send_sms))   /*0 车辆相关信息 1 网络系统配置信息 2位置信息*/
	{
		/*直接发送信息*/
		if( *value == '0' )
		{
			sprintf( buf, "TCBTW703#%s#%s#%s#%d",
			         jt808_param.id_0x0083 + 2,
			         jt808_param.id_0xF002,
			         jt808_param.id_0xF005,
			         jt808_param.id_0x0029 );
			sms_send( buf, 0  );
		}

		if( *value == '1' )
		{
			sprintf( buf, "TCBTW703#%s#%s#%s#%d",
			         jt808_param.id_0x0083 + 2,
			         jt808_param.id_0xF002,
			         jt808_param.id_0x0013,
			         jt808_param.id_0x0018);
			sms_send( buf, 0  );
		}
		if( *value == '2' )
		{
			sprintf( buf, "TCBTW703#%s#%s#%s#%d",
			         jt808_param.id_0x0083 + 2,
			         jt808_param.id_0xF002,
			         jt808_param.id_0xF005,
			         jt808_param.id_0x0029 );
			sms_send( buf, 0  );
		}

