icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_sms.c
		return 0;
	}
	else if( strncmp( cmd, "ISP", 3 ) == 0 )         /*	ISP(202.89.23.210：9000)*/
	{
		sscanf(value,"%s:%d",ip,&port);
		gsm_socket[2].index=2;
		strcpy(gsm_socket[2].ipstr,ip);
		gsm_socket[2].port=port;
		gsm_socket[2].state=CONNECT_IDLE;
		return 1;
	}
	else if( strncmp( cmd, "PLATENUM", 8 ) == 0 )    /*PLATENUM(津A8888)	*/
	{
		strcpy(jt808_param.id_0x0083,value);
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	else if( strncmp( cmd, "COLOR", 5 ) == 0 )       /* COLOR(0) 1： 蓝色  2： 黄色    3： 黑色    4： 白色    9：  其他*/
	{
		jt808_param.id_0x0084=atoi(value);
		sms_command |= SMS_CMD_SAVEPARAM;
		return 1;
	}
	else if( strncmp( cmd, "CONNECT", 7 ) == 0 )     /*CONNECT(0)  0:  DNSR   优先     1：  MainIP   优先 */
	{
		return 1;
	}
	else if( strncmp( cmd, "PASSWORD", 7 ) == 0 )    /*PASSWORD（0） 1： 通过   0： 不通过*/
	{
		return 1;
	}
	else if( strncmp( cmd, "FACT", 4 ) == 0 )   	/*1 清空参数，2清空数据*/
	{
		/*直接发送信息*/
		if( *value == '1' )
		{
			//factory(1);
			sms_command |= SMS_CMD_FACTSET;
		}

		else if( *value == '2' )
		{
			//factory(2);
			sms_command |= SMS_CMD_FACTSETDATA;
		}

		return 1;
	}
	else if(( strncmp( cmd, "0x", 2 ) == 0 )||( strncmp( cmd, "0X", 2 ) == 0 ))    /*设置808协议0x8103对应的参数*/
	{
		if(cmd[1]=='X')
		{
			cmd[1]='x';
		}
		if(sscanf( cmd, "%x", &id )==1)
		{
			if(jt808_param_set(id, value))
			{
				sms_command |= SMS_CMD_SAVEPARAM;
				return 1;
			}
		}
	}
	return 0;
}
FINSH_FUNCTION_EXPORT( analy_param, sms analy_param );

/*********************************************************************************
  *函数名称:void sms_param_proc(char *info_msg,uint8_t send_sms)
  *功能描述:处理收到的短信内容，需要回复短信的话需要send_sms为非0值
  *输	入:	info_msg:收到的短信内容，该内容是已经解码的短信内容
  			send_sms:为0表示不回复短信，非0表示需要回复短信
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-12-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
uint8_t sms_param_proc(char *info_msg,uint8_t send_sms)
{
	uint16_t	i;
	uint16_t	count;
	uint8_t		cmd_step=0;
	char		*p;
	char		*psave;
	char		cmd[32];
	char		value[64];
	char		tmpbuf[180];        /*解码后的信息*/
	
	/*decode_msg保存解码后的信息*/
		p = info_msg;
		if(( strncmp( p, "TW703", 5 ) != 0 )&&( strncmp( p, "TW705", 5 ) != 0 ))
		{
			return 0;
		}
		sprintf(tmpbuf,"SMS(%d,%s):%s",send_sms,sender,info_msg);
		sd_write_console(tmpbuf);
		p += 5;
		memset( cmd, 0, sizeof(cmd) );
		memset( value, 0, sizeof(value) );
		count	= 0;
		psave	= cmd;
		i		= 0;
	/*tmpbuf用作应答的信息 TW703#*/
		while( *p != 0 )
		{
			switch( *p )
			{
				case '#':
					cmd_step = 1;
					memset( cmd, 0, sizeof(cmd) );
					memset( value, 0, sizeof(value) );
					psave	= cmd;		/*先往cmd缓冲中存*/
					count	= 0;
					break;
				case '(':
					if(cmd_step == 1)
						cmd_step = 2;
					psave	= value;	/*向取值区保存*/
					count	= 0;
					break;
				case ')':				/*表示结束,不保存*/
					if(cmd_step == 2)
					{
						i += analy_param( cmd, value, send_sms );
						cmd_step = 0;
					}
					break;
				default:
					if( count < 64 )	/*正常，保存*/
					{
						*psave++ = *p;
						count++;
					}
					break;
			}
			p++;
		}
		if((i)&&(send_sms))
		{
			memset(tmpbuf,0,sizeof(tmpbuf));
			sprintf( tmpbuf, "%s#%-7s#%s", jt808_param.id_0x0083, jt808_param.id_0xF002, info_msg + 6 );
	
			sms_send(tmpbuf,0);
		}
		if(sms_command)
		{
			if(sms_command & SMS_CMD_RESET)
			{
				//reset(4);
				control_device(DEVICE_RESET_DEVICE,0xFFFFFFFF);
				device_control.delay_counter = 60;
			}
			if(sms_command & SMS_CMD_RELINK)
			{
				gsmstate( GSM_POWEROFF );
			}
			if(sms_command & SMS_CMD_FACTSET)
			{
				factory(1);
				control_device(DEVICE_RESET_DEVICE,0xFFFFFFFF);
			}
			if(sms_command & SMS_CMD_SAVEPARAM)
			{
				param_save( 1 );
			}
			if(sms_command & SMS_CMD_FACTSETDATA)
			{
				factory(2);
				control_device(DEVICE_RESET_DEVICE,0xFFFFFFFF);
			}
			sms_command = 0;
		}
		return 1;

}


/*********************************************************************************
  *函数名称:void jt808_sms_rx( char *info, uint16_t size )
  *功能描述:收到短信息处理,并且回复短信内容
  *输	入:	info	:收到的短信内容，该内容是PDU编码的短信内容
  			size	:info的长度
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-12-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void jt808_sms_rx_old( char *info, uint16_t size )
{
	uint16_t	i;
	uint8_t		tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	char		*p, *pdst;
	char		c, pid;
	uint16_t	len;
	uint8_t		pdu_type, msg_len;
	uint8_t		dcs;

	char		decode_msg[180];    /*解码后的信息*/
	uint16_t	decode_msg_len = 0;
	char		tmpbuf[180];        /*解码后的信息*/

	char		cmd[64];
	char		value[64];
	uint8_t		count;
	char		*psave;
	uint8_t		cmd_step=0;

	memset( sender, 0, sizeof(sender) );
	memset( smsc, 0, sizeof(smsc) );
	p = info;                       /*重新定位到开始*/
	/*SCA*/
	len = tbl[p[0] - '0'] << 4;
	len |= tbl[p[1] - '0'];         /*服务中心号码 Length (长度)+Tosca（服务中心类型）+Address（地址）*/
	
	if(len>12)
		return;
	len <<= 1;                      /*转成双字*/
	for( i = 0; i < len + 2; i++ )  /*包括长度*/
	{
		smsc[i] = *p++;
	}
	/*pdu类型*/
	pdu_type	= tbl[*p++ - '0'] << 4;
	pdu_type	|= tbl[*p++ - '0'];

	/*OA来源地址 05 A1 0180F6*/
	/*M50模块在收到的地址中地址类型为A1,发送的时候不成功，需要转换为9186(91表示为国际号码，86表示中国)才能发送ok*/
	len = tbl[p[0] - '0'] << 4;
	len |= tbl[p[1] - '0']; /*手机发送源地址 Length (长度,是数字个数)+Tosca（地址类型）+Address（地址）*/
	
	if(len>21)
		return;
	if(strncmp(p+4,"68",2) != 0)
	{
		sprintf(sender,"%02X9168",len+2);
		if( len & 0x01 )
		{
			len++;              /*这里是数字位数，比如10086是5位 用三个字节表示*/
		}
		strncpy(sender+6,p+4,len);
	}
	else
	{
		if( len & 0x01 )
		{
			len++;              /*这里是数字位数，比如10086是5位 用三个字节表示*/
		}
		strncpy(sender,p,len+4);
	}
	p	+= 4+len;
	rt_kprintf("\nSMS>sender=%s",sender);

	/*PID标志*/
	pid = tbl[*p++ - '0'] << 4;
	pid |= tbl[*p++ - '0'];
	/*DCS编码*/
	dcs = tbl[*p++ - '0'] << 4;
	dcs |= tbl[*p++ - '0'];
	/*SCTS服务中心时间戳 yymmddhhmmsszz 包含时区*/
	p += 14;
	/*消息长度*/
	//msg_len = tbl[*p++ - '0'] << 4;
	//msg_len |= tbl[*p++ - '0'];
	p += 2;
	
