icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_sms.c
	if((uint32_t)info + size <= (uint32_t)p)
	{
		return;
	}
	msg_len = ((uint32_t)info + size - (uint32_t)p)/2;
	/*是否为长信息pdu_type 的bit6 UDHI=1*/
	if( pdu_type & 0x40 )           /*跳过长信息的头*/
	{
		if( ( dcs & 0x0c ) != GSM_7BIT )		///暂时不处理7bit编码的情况，因为7bit编码对该区域也编码了
			{
			len		= tbl[*p++ - '0'] << 4;
			len		|= tbl[*p++ - '0'];
			p		+= ( len << 1 );    /*现在还是OCT模式*/
			msg_len -= ( len + 1 );     /*长度占一个字节*/
			}
	}
	
	rt_kprintf( "\nSMS>PDU Type=%02x PID=%02x DCS=%02x TP-UDL=%d", pdu_type, pid, dcs, msg_len );

/*直接在info上操作有误?*/
	pdst = tmpbuf;
	/*将OCT数据转为HEX,两个字节拼成一个*/
	for( i = 0; i < msg_len; i++ )
	{
		c		= tbl[*p++ - '0'] << 4;
		c		|= tbl[*p++ - '0'];
		*pdst++ = c;
	}
	*pdst = 0;

	if( ( dcs & 0x0c ) == GSM_7BIT )
	{
		decode_msg_len = gsmdecode7bit( tmpbuf, decode_msg, msg_len );
		/*将用户数据头部分去掉*/
		len = tmpbuf[0] + 1;		//计算用户数据，包含了 用户数据头长度(1byte) + 用户数据;
		if(len * 8 % 7)
			{
			len = len * 8 / 7 + 1;
			}
		else
			{
			len =  len * 8 / 7;
			}
		if(( pdu_type & 0x40 )&&(len < decode_msg_len))
			{
			decode_msg_len	-= len;
			memcpy(tmpbuf,decode_msg+len,decode_msg_len);
			memcpy(decode_msg,tmpbuf,decode_msg_len);
			}
	}else if( ( dcs & 0x0c ) == GSM_UCS2 )
	{
		decode_msg_len = gsmdecodeucs2( tmpbuf, decode_msg, msg_len );
	}else
	{
		memcpy( decode_msg, tmpbuf, msg_len );
		decode_msg_len = msg_len;   /*简单拷贝即可*/
	}

	if( decode_msg_len == 0 )       /*对于不是合法的数据是不是直接返回0*/
	{
		return;
	}
	decode_msg[decode_msg_len] = 0;

/*decode_msg保存解码后的信息*/
	p = decode_msg;
	rt_kprintf( "\nSMS(%dbytes)>%s", decode_msg_len, p );
	if(( strncmp( p, "TW703", 5 ) != 0 )&&( strncmp( p, "TW705", 5 ) != 0 ))
	{
		return;
	}
	p += 5;
	memset( cmd, 0, 64 );
	memset( value, 0, 64 );
	count	= 0;
	psave	= cmd;
	i		= 0;
/*tmpbuf用作应答的信息 TW703#*/
	while( *p != 0 )
	{
		switch( *p )
		{
			case '#':
				cmd_step = 1;
				memset( cmd, 0, 64 );
				memset( value, 0, 64 );
				psave	= cmd;      /*先往cmd缓冲中存*/
				count	= 0;
				break;
			case '(':
				if(cmd_step == 1)
					cmd_step = 2;
				psave	= value;    /*向取值区保存*/
				count	= 0;
				break;
			case ')':               /*表示结束,不保存*/
				if(cmd_step == 2)
				{
					i += analy_param( cmd, value, 1 ) ;
					cmd_step = 0;
				}
				break;
			default:
				if( count < 64 )    /*正常，保存*/
				{
					*psave++ = *p;
					count++;
				}
				break;
		}
		p++;
	}

	if(i)
	{
		memset(tmpbuf,0,sizeof(tmpbuf));
		sprintf( tmpbuf, "%s#%-7s#%s", jt808_param.id_0x0083, jt808_param.id_0xF002, decode_msg + 6 );

		sms_send(tmpbuf,0);
	}
	
	if(sms_command)
	{
		if(sms_command & SMS_CMD_RESET)
		{
			reset(4);
		}
		if(sms_command & SMS_CMD_RELINK)
		{
			gsmstate( GSM_POWEROFF );
		}
		if(sms_command & SMS_CMD_FACTSET)
		{
			rt_kprintf("SMS> 恢复出厂参数;");
		}
		if(sms_command & SMS_CMD_SAVEPARAM)
		{
			param_save( 1 );
		}
		sms_command = 0;
	}
}

/*********************************************************************************
  *函数名称:void jt808_sms_rx( char *info, uint16_t size )
  *功能描述:收到短信息处理,并且回复短信内容
  *输	入:	info	:收到的短信内容，该内容是PDU编码的短信内容
  			size	:info的长度
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-12-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void jt808_sms_rx( char *info, uint16_t size )
{
	uint16_t	i;
	uint8_t		tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	char		*p, *pdst;
	char		c, pid;
	uint16_t	len;
	uint8_t		pdu_type, msg_len;
	uint8_t		dcs;

	char		decode_msg[180];    /*解码后的信息*/
	uint16_t	decode_msg_len = 0;
	char		tmpbuf[180];        /*解码后的信息*/

	//char		cmd[64];
	//char		value[64];
	//uint8_t		count;
	//char		*psave;
	//uint8_t		cmd_step=0;

	memset( sender, 0, sizeof(sender) );
	memset( smsc, 0, sizeof(smsc) );
	p = info;                       /*重新定位到开始*/
	/*SCA*/
	len = tbl[p[0] - '0'] << 4;
	len |= tbl[p[1] - '0'];         /*服务中心号码 Length (长度)+Tosca（服务中心类型）+Address（地址）*/
	
	if(len>12)
		return;
	len <<= 1;                      /*转成双字*/
	for( i = 0; i < len + 2; i++ )  /*包括长度*/
	{
		smsc[i] = *p++;
	}
	/*pdu类型*/
	pdu_type	= tbl[*p++ - '0'] << 4;
	pdu_type	|= tbl[*p++ - '0'];

	/*OA来源地址 05 A1 0180F6*/
	/*M50模块在收到的地址中地址类型为A1,发送的时候不成功，需要转换为9186(91表示为国际号码，86表示中国)才能发送ok*/
	len = tbl[p[0] - '0'] << 4;
	len |= tbl[p[1] - '0']; /*手机发送源地址 Length (长度,是数字个数)+Tosca（地址类型）+Address（地址）*/
	
	if(len>21)
		return;
	if(strncmp(p+4,"68",2) != 0)
	{
		sprintf(sender,"%02X9168",len+2);
		if( len & 0x01 )
		{
			len++;              /*这里是数字位数，比如10086是5位 用三个字节表示*/
		}
		strncpy(sender+6,p+4,len);
	}
	else
	{
		if( len & 0x01 )
		{
			len++;              /*这里是数字位数，比如10086是5位 用三个字节表示*/
		}
		strncpy(sender,p,len+4);
	}
	p	+= 4+len;
	rt_kprintf("\nSMS>sender=%s",sender);

	/*PID标志*/
	pid = tbl[*p++ - '0'] << 4;
	pid |= tbl[*p++ - '0'];
	/*DCS编码*/
	dcs = tbl[*p++ - '0'] << 4;
	dcs |= tbl[*p++ - '0'];
	/*SCTS服务中心时间戳 yymmddhhmmsszz 包含时区*/
	p += 14;
	/*消息长度*/
	//msg_len = tbl[*p++ - '0'] << 4;
	//msg_len |= tbl[*p++ - '0'];
	p += 2;
	
	if((uint32_t)info + size <= (uint32_t)p)
	{
		return;
	}
	msg_len = ((uint32_t)info + size - (uint32_t)p)/2;
	/*是否为长信息pdu_type 的bit6 UDHI=1*/
	if( pdu_type & 0x40 )           /*跳过长信息的头*/
	{
		if( ( dcs & 0x0c ) != GSM_7BIT )		///暂时不处理7bit编码的情况，因为7bit编码对该区域也编码了
			{
			len		= tbl[*p++ - '0'] << 4;
			len		|= tbl[*p++ - '0'];
			p		+= ( len << 1 );    /*现在还是OCT模式*/
			msg_len -= ( len + 1 );     /*长度占一个字节*/
			}
	}
	
	rt_kprintf( "\nSMS>PDU Type=%02x PID=%02x DCS=%02x TP-UDL=%d", pdu_type, pid, dcs, msg_len );

/*直接在info上操作有误?*/
	pdst = tmpbuf;
	/*将OCT数据转为HEX,两个字节拼成一个*/
	for( i = 0; i < msg_len; i++ )
	{
		c		= tbl[*p++ - '0'] << 4;
		c		|= tbl[*p++ - '0'];
		*pdst++ = c;
	}
	*pdst = 0;

	if( ( dcs & 0x0c ) == GSM_7BIT )
	{
		decode_msg_len = gsmdecode7bit( tmpbuf, decode_msg, msg_len );
		/*将用户数据头部分去掉*/
		len = tmpbuf[0] + 1;		//计算用户数据，包含了 用户数据头长度(1byte) + 用户数据;
		if(len * 8 % 7)
			{
			len = len * 8 / 7 + 1;
			}
		else
			{
			len =  len * 8 / 7;
			}
		if(( pdu_type & 0x40 )&&(len < decode_msg_len))
			{
			decode_msg_len	-= len;
			memcpy(tmpbuf,decode_msg+len,decode_msg_len);
			memcpy(decode_msg,tmpbuf,decode_msg_len);
			}
	}else if( ( dcs & 0x0c ) == GSM_UCS2 )
	{
		decode_msg_len = gsmdecodeucs2( tmpbuf, decode_msg, msg_len );
	}else
	{
		memcpy( decode_msg, tmpbuf, msg_len );
		decode_msg_len = msg_len;   /*简单拷贝即可*/
	}

