icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_sms.c
	if( decode_msg_len == 0 )       /*对于不是合法的数据是不是直接返回0*/
	{
		return;
	}
	decode_msg[decode_msg_len] = 0;


//////
/*decode_msg保存解码后的信息*/
	rt_kprintf( "\nSMS(%dbytes)>%s", decode_msg_len, decode_msg );
	sms_param_proc(decode_msg,1);
#if 0
	p = decode_msg;
	if(( strncmp( p, "TW703", 5 ) != 0 )&&( strncmp( p, "TW705", 5 ) != 0 ))
	{
		return;
	}
	p += 5;
	memset( cmd, 0, 64 );
	memset( value, 0, 64 );
	count	= 0;
	psave	= cmd;
	i		= 0;
/*tmpbuf用作应答的信息 TW703#*/
	while( *p != 0 )
	{
		switch( *p )
		{
			case '#':
				cmd_step = 1;
				memset( cmd, 0, 64 );
				memset( value, 0, 64 );
				psave	= cmd;      /*先往cmd缓冲中存*/
				count	= 0;
				break;
			case '(':
				if(cmd_step == 1)
					cmd_step = 2;
				psave	= value;    /*向取值区保存*/
				count	= 0;
				break;
			case ')':               /*表示结束,不保存*/
				if(cmd_step == 2)
				{
					i += analy_param( cmd, value ,1);
					cmd_step = 0;
				}
				break;
			default:
				if( count < 64 )    /*正常，保存*/
				{
					*psave++ = *p;
					count++;
				}
				break;
		}
		p++;
	}

	if(i)
	{
		memset(tmpbuf,0,sizeof(tmpbuf));
		sprintf( tmpbuf, "%s#%-7s#%s", jt808_param.id_0x0083, jt808_param.id_0xF002, decode_msg + 6 );

		sms_send(tmpbuf,0);
	}
	
	if(sms_command)
	{
		if(sms_command & SMS_CMD_RESET)
		{
			reset(4);
		}
		if(sms_command & SMS_CMD_RELINK)
		{
			gsmstate( GSM_POWEROFF );
		}
		if(sms_command & SMS_CMD_FACTSET)
		{
			rt_kprintf("SMS> 恢复出厂参数;");
		}
		if(sms_command & SMS_CMD_SAVEPARAM)
		{
			param_save( 1 );
		}
		sms_command = 0;
	}
#endif
}




#if 1
/*
   0891683108200205F0000D91683106029691F10008318011216584232C0054005700370030003300230050004C004100540045004E0055004D00286D25005400540036003500320029
   0891683108200205F0000D91683106029691F100003180112175222332D4EB0D361B0D9F4E67714845C15223A2732A8DA1D4F498EB7C46E7E17497BB4C4F8DA04F293586BAC160B814

   在线验证

   http://www.diafaan.com/sms-tutorials/gsm-modem-tutorial/online-sms-submit-pdu-decoder/
 */
void sms_test( uint8_t index )
{
	char *s[] =
	{ "0891683108200205F0000D91683128504568F30008318011216584232C0054005700370030003300230050004C004100540045004E0055004D00286D25005400540036003500320029",
	  "0891683108200205F0000D91683128504568F300003180112175222332D4EB0D361B0D9F4E67714845C15223A2732A8DA1D4F498EB7C46E7E17497BB4C4F8DA04F293586BAC160B814",
	  "0891683108200245F3240D90683128504568F30008312132513452232E6D259655004000280029004000230062006100630063006100620061003100310031003200320032003300330033"};
	jt808_sms_rx( s[index], strlen( s[index] ) );
}

FINSH_FUNCTION_EXPORT( sms_test, test sms );


void oiap_test(char *ip,uint16_t port)
{
	gsm_socket[2].index=2;
	strcpy(gsm_socket[2].ipstr,ip);
	gsm_socket[2].port=port;
	gsm_socket[2].state=CONNECT_IDLE;
}
FINSH_FUNCTION_EXPORT( oiap_test, conn onair iap );

#endif

/************************************** The End Of File **************************************/
